In [0]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy import nan

In [0]:
data = Series(['one', 'two', nan, 'four']) # 欠損値あり

In [4]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [5]:
data.isnull() # 欠損値チェック

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
data.dropna() # データから欠損値を取り除く

0     one
1     two
3    four
dtype: object

In [0]:
dframe = DataFrame([[1, 2, 3], [nan, 5, 6], [7, nan, 9], [nan, nan, nan]]) # 欠損値あり

In [10]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [11]:
dframe.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [12]:
dframe.dropna() # 欠損値を取り除く。欠損値のある行を取り除く

     0    1    2
0  1.0  2.0  3.0

In [13]:
dframe.dropna(how='all') # 欠損値を取り除く。全てが欠損値の行を取り除く

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [14]:
dframe.dropna(axis=1) # 欠損値がある列を取り除く

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [0]:
dframe2 = DataFrame([[1, 2, 3, nan], [2, nan, 5, 6], [nan, 7, nan, 9], [1, nan, nan, nan]])

In [18]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [19]:
dframe2.dropna(thresh=2) # 閾値を指定して欠損値を取り除く。欠損値でない値が指定された値未満の行を取り除く

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [20]:
dframe2.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [21]:
dframe2.fillna(1) # 欠損値を指定した値で埋める

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [22]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [23]:
dframe2.fillna({0:0, 1:1, 2:2, 3:3}) # 列ごとに欠損値を埋める値を指定することができる

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [0]:
dframe2.fillna(0, inplace=True) # 欠損値を0で埋める（破壊的）

In [25]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0